---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsPipeSlopeOptionsDefParam
source: html/3e2b159c-4d23-0c84-5b6a-df1a9053fb71.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsPipeSlopeOptionsDefParam Property

"Pipe Slope Options"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsPipeSlopeOptionsDefParam { get; }
```